# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-bundle'

# Install Binaries
brew 'awscli'
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mackup'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'nvm'
brew 'go'
brew 'php'
brew 'mysql'
brew 'redis'

# Apps
cask 'caffeine'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'skype'
cask 'vscode'
cask 'iterm2'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-mono'
cask 'font-fira-sans'
