# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'awscli'
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mackup'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'go'
brew 'dep'
brew 'php'
brew 'mysql'
brew 'nvm'
brew 'redis'

# Apps
cask 'caffeine'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'insomnia'
cask 'sequel-pro'
cask 'shuttle'
cask 'slack'
cask 'sublime-text'
cask 'spotify'
cask 'skype'
cask 'vscode'
cask 'hyper'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-mono-for-powerline'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-mono'
cask 'font-fira-sans'

# Install Mac App Store apps
mas '1Password', id: 1333542190
mas 'Todoist', id: 572688855
mas 'WhatsApp', id: 1147396723
mas 'Bear', id: 1091189122
